REPLACE INTO `ocenter_menu` (`id`, `title`, `pid`, `sort`, `url`, `hide`, `tip`, `group`, `is_dev`, `icon`) VALUES
(1008, '类型管理', 116, 0, 'Invite/index', 0, '', '邀请注册管理', 0, ''),
(1009, '邀请码管理', 116, 0, 'Invite/invite', 0, '', '邀请注册管理', 0, ''),
(1010, '基础配置', 116, 0, 'Invite/config', 0, '', '邀请注册管理', 0, ''),
(1011, '兑换记录', 116, 0, 'Invite/buyLog', 0, '', '邀请注册管理', 0, ''),
(1012, '邀请记录', 116, 0, 'Invite/inviteLog', 0, '', '邀请注册管理', 0, ''),
(1013, '用户信息', 116, 0, 'Invite/userInfo', 0, '', '邀请注册管理', 0, ''),
(1014, '编辑邀请注册类型', 1008, 0, 'Invite/edit', 1, '', '', 0, ''),
(1015, '删除邀请', 1008, 0, 'Invite/setStatus', 1, '', '', 0, ''),
(1016, '删除邀请码', 1009, 0, 'Invite/delete', 1, '', '', 0, ''),
(1017, '生成邀请码', 1009, 0, 'Invite/createCode', 1, '', '', 0, ''),
(1018, '删除无用邀请码', 1009, 0, 'Invite/deleteTrue', 1, '', '', 0, ''),
(1019, '导出cvs', 1009, 0, 'Invite/cvs', 1, '', '', 0, ''),
(1020, '用户信息编辑', 1013, 0, 'Invite/editUserInfo', 1, '', '', 0, '');